# Модуль составления матрицы жесткости элементов
# Внешняя нумерация - строки; внутренняя - столбцы
#  EF1 -EF1
# -EF1  EF1

def matrix(EF1, EF2, EF3, C1, C2):
    K1 = [[EF1, -EF1],
          [-EF1, EF1]]
    K2 = [[EF2, -EF2],
          [-EF2, EF2]]
    K3 = [[EF3, -EF3],
          [-EF3, EF3]]
    K4 = [[C1, -C1],
          [-C1, C1]]
    K5 = [[C2, -C2],
          [-C2, C2]]

    print("K1:", K1)
    print("K2:", K2)
    print("K3:", K3)
    print("K4:", K4)
    print("K5:", K5)

    K = [[K1[0][0], K1[0][1], 0, 0, 0, 0],
         [K1[1][0], K1[1][1] + K2[0][0] + K4[1][1], K2[0][1], 0, K4[1][0], 0],
         [0, K2[1][0], K2[1][1] + K3[0][0] + K5[1][1], K3[0][1], 0, K5[0][1]],
         [0, 0, K3[1][0], K3[1][1], 0, 0],
         [0, K4[0][1], 0, 0, K4[0][0], 0],
         [0, 0, K5[1][0], 0, 0, K5[1][1]]]

    return K
